app/views/jobs/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	    	  <td><%= job.description %></td>
	    	  <td><%= job.user.first %> <%= job.user.last %>  </td>