app/views/users/show.html.erb

		    <label for="user[first]">First Name</label>
		    <input type="text" class="form-control" name="user[first]" value="<%= @user.first %>">
---
SELECT "users".* FROM "users"