app/views/clocks/edit.html.erb

		    <label for="clock[employee]">Employee</label>
		    <input type="text" class="form-control" name="clock[employee]" value="<%= @clock.user.first %> <%= @clock.user.last %>">
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]