app/views/clocks/new.html.erb

	   	 	<tr>
	   	 	  <td><%= c.user.first %> <%= c.user.last %> </td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]