app/controllers/clocks_controller.rb

  def new
  	@jobs = Job.where(completed: false)
    @clocks = Clock.where(user: current_user)
---
SELECT  "clocks".* FROM "clocks" WHERE "clocks"."user_id" = 6 ORDER BY "clocks"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def edit
    @clock = Clock.find_by(id: params[:id])
---
SELECT  "clocks".* FROM "clocks" WHERE "clocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def clockin
  	@clock = Clock.create(clock_params)
---
INSERT INTO "clocks" ("job_id", "user_id", "created_at", "updated_at", "clockedin") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["job_id", 1], ["user_id", 3], ["created_at", "2019-12-23 20:05:42.266015"], ["updated_at", "2019-12-23 20:05:42.266015"], ["clockedin", "t"]]

  def update
    @clock = Clock.find_by(id: params[:id])
    if @clock.update(update_clock)
---
SELECT  "clocks".* FROM "clocks" WHERE "clocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "clocks" SET "job_id" = $1, "time" = $2, "clockedin" = $3, "updated_at" = $4 WHERE "clocks"."id" = $5  [["job_id", 1], ["time", 7], ["clockedin", "f"], ["updated_at", "2020-02-27 17:59:08.956372"], ["id", 12]]

  def clockout
    @clock = Clock.find_by(user: current_user, clockedin: true)
    puts "THIS IS THE CLOCK AND It does ROCK #{@clock.user.first}"
    @clock.clockedin = false;
    if @clock.save
---
SELECT  "clocks".* FROM "clocks" WHERE "clocks"."user_id" = 1 AND "clocks"."clockedin" = $1 LIMIT $2  [["clockedin", "t"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "clocks" SET "clockedin" = $1, "updated_at" = $2, "time" = $3 WHERE "clocks"."id" = $4  [["clockedin", "f"], ["updated_at", "2020-02-27 17:13:04.404686"], ["time", 0], ["id", 9]]