app/controllers/users_controller.rb

  def new
  	@positions = Position.all
---
SELECT "positions".* FROM "positions"

  def create
  	@user = User.create(user_params)
---
INSERT INTO "users" ("first", "last", "email", "address", "city", "state", "password_digest", "admin", "created_at", "updated_at", "position_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def show
  	# @user = User.find_by(id: params[:id])
  	@positions = Position.all
---
SELECT "positions".* FROM "positions"

  def update
    # @user = User.find_by(id: params[:id])
    if !current_user.admin
      if @user != current_user
        redirect_to '/error'
      end
    end
    if @user.update(user_up)
---
UPDATE "users" SET "first" = $1, "last" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first", "Bob"], ["last", "Hope"], ["updated_at", "2020-03-21 18:14:40.083102"], ["id", 2]]